var min = [61.974303, 13.103665];
var max = [156.586507, 49.133313];


var w_min = [0,0];
var w_max = [0,0];
// ====================================
// 所有用户的数据
var Hong_data = [
  // 
  {
    lnglat: [116.258446, 37.686622],
    // 
    id: 1,
    rotation: 30,
  },
  // 
  {
    lnglat: [116.258446, 37.686622],
    id: 1,
    rotation: 30,
  },
  // 
  {
    lnglat: [116.258446, 37.686622],
    id: 1,
    rotation: 30,
  },
  // 
  {
    lnglat: [116.258446, 37.686622],
    id: 1,
    rotation: 30,
  },
];


// 微观的数据格式
var Wei_data = [
  // 
  {
    lnglat: [116.258446, 37.686622],
    // 
    id: 1,
    rotation: 30,
  },
  // 
  {
    lnglat: [116.258446, 37.686622],
    id: 1,
    rotation: 30,
  },
  // 
  {
    lnglat: [116.258446, 37.686622],
    id: 1,
    rotation: 30,
  },
  // 
  {
    lnglat: [116.258446, 37.686622],
    id: 1,
    rotation: 30,
  },
];




